## creating a dataframe

In [7]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

cars={'BRAND':['HONDA','TOYOTA','AUDI','FORD'],
     'PRICE':[22000,25000,27000,35000] 
     }
df=pd.DataFrame(cars)
df.head()

    BRAND  PRICE
0   HONDA  22000
1  TOYOTA  25000
2    AUDI  27000
3    FORD  35000

In [26]:
student_details={'NAME':['Abhimanyu Ravi CR','Ajith TA','AKSHAY A','Alen Tom Shaji','Anand Anil','Ansal M T','ARUN KUMAR N','Aswin C S','DIAVOOD NASSAR','HARIPRIYA.K.U','Indrajith Kk','Jishnu vs','Jishnuraj mp','JOBIKA','keerthi ravi','kiran k s','LUBNA NIZAR','Mancy Mamachan','merlin p m','Mohammed Safeer','Muhammed Siraj k','Nandakrishnan N','NAJMI JAHANGIR','Nida Musthafa','RAHUL N','Ramshad TA','Sanika Sajeevan','Sanoy K M','shammas n m','Smijith CS','Sneha Shaji','soorya.s. nair','SWATHIAS','vidhya ag','Vishnu Mukundan'],
'PYTHON':[24,25,24,25,25,25,24,24,24,24,25,25,23,24,25,24,24,25,24,24,24,0,25,25,25,25,25,24,24,24,22,24,25,23,24],
'STAT':[15,15,18,18,16,19,15,13,16,17,13,15,15,13,16,20,16,16,16,15,19,0,13,15,16,19,17,15,17,13,13,16,16,17,17],
'TOTAL':[39,40,42,43,41,44,39,37,40,41,38,40,38,37,41,44,40,41,40,39,43,0,38,40,41,44,42,39,41,37,35,40,41,40,41],                
'PERCENTAGE':[86.67,88.89,93.33,95.56,91.11,97.78,86.67,82.22,88.89,91.11,84.44,88.89,84.44,82.22,91.11,97.78,88.89,91.11,88.89,86.67,95.56,0,84.44,88.89,91.11,97.78,93.33,86.67,91.11,82.22,77.78,88.89,91.11,88.89,91.11]          
                }
df=pd.DataFrame(student_details)
df

                 NAME  PYTHON  STAT  TOTAL  PERCENTAGE
0   Abhimanyu Ravi CR      24    15     39       86.67
1            Ajith TA      25    15     40       88.89
2            AKSHAY A      24    18     42       93.33
3      Alen Tom Shaji      25    18     43       95.56
4          Anand Anil      25    16     41       91.11
5           Ansal M T      25    19     44       97.78
6        ARUN KUMAR N      24    15     39       86.67
7           Aswin C S      24    13     37       82.22
8      DIAVOOD NASSAR      24    16     40       88.89
9       HARIPRIYA.K.U      24    17     41       91.11
10       Indrajith Kk      25    13     38       84.44
11          Jishnu vs      25    15     40       88.89
12       Jishnuraj mp      23    15     38       84.44
13             JOBIKA      24    13     37       82.22
14       keerthi ravi      25    16     41       91.11
15          kiran k s      24    20     44       97.78
16        LUBNA NIZAR      24    16     40       88.89
17     Mancy Mamachan      25    16     41       91.11
18         merlin p m      24    16     40       88.89
19    Mohammed Safeer      24    15     39       86.67
20   Muhammed Siraj k      24    19     43       95.56
21    Nandakrishnan N       0     0      0        0.00
22     NAJMI JAHANGIR      25    13     38       84.44
23      Nida Musthafa      25    15     40       88.89
24            RAHUL N      25    16     41       91.11
25         Ramshad TA      25    19     44       97.78
26    Sanika Sajeevan      25    17     42       93.33
27          Sanoy K M      24    15     39       86.67
28        shammas n m      24    17     41       91.11
29         Smijith CS      24    13     37       82.22
30        Sneha Shaji      22    13     35       77.78
31     soorya.s. nair      24    16     40       88.89
32           SWATHIAS      25    16     41       91.11
33          vidhya ag      23    17     40       88.89
34    Vishnu Mukundan      24    17     41       91.11

## top rank

In [28]:
df['TOTAL'].max()

44

In [29]:
df['TOTAL'].min()

0

## average

In [30]:
df['TOTAL'].mean()

39.02857142857143

In [31]:
df['TOTAL'].std()

7.106276075685883

### Top student

In [33]:
df['TOTAL'].max()

44

In [34]:
top_student=df[df['TOTAL']==44]

In [35]:
top_student

          NAME  PYTHON  STAT  TOTAL  PERCENTAGE
5    Ansal M T      25    19     44       97.78
15   kiran k s      24    20     44       97.78
25  Ramshad TA      25    19     44       97.78

## indexing

In [36]:
df.loc[1]

NAME          Ajith TA
PYTHON              25
STAT                15
TOTAL               40
PERCENTAGE       88.89
Name: 1, dtype: object

In [37]:
df.iloc[1]

NAME          Ajith TA
PYTHON              25
STAT                15
TOTAL               40
PERCENTAGE       88.89
Name: 1, dtype: object

In [38]:
df.set_index('NAME',inplace=True)
df.head()

                   PYTHON  STAT  TOTAL  PERCENTAGE
NAME
Abhimanyu Ravi CR      24    15     39       86.67
Ajith TA               25    15     40       88.89
AKSHAY A               24    18     42       93.33
Alen Tom Shaji         25    18     43       95.56
Anand Anil             25    16     41       91.11

In [40]:
df.loc['Ajith TA']

PYTHON        25.00
STAT          15.00
TOTAL         40.00
PERCENTAGE    88.89
Name: Ajith TA, dtype: float64

In [42]:
df.iloc[1]

PYTHON        25.00
STAT          15.00
TOTAL         40.00
PERCENTAGE    88.89
Name: Ajith TA, dtype: float64

## conditional operator

In [43]:
df[df['TOTAL']>40]

                  PYTHON  STAT  TOTAL  PERCENTAGE
NAME
AKSHAY A              24    18     42       93.33
Alen Tom Shaji        25    18     43       95.56
Anand Anil            25    16     41       91.11
Ansal M T             25    19     44       97.78
HARIPRIYA.K.U         24    17     41       91.11
keerthi ravi          25    16     41       91.11
kiran k s             24    20     44       97.78
Mancy Mamachan        25    16     41       91.11
Muhammed Siraj k      24    19     43       95.56
RAHUL N               25    16     41       91.11
Ramshad TA            25    19     44       97.78
Sanika Sajeevan       25    17     42       93.33
shammas n m           24    17     41       91.11
SWATHIAS              25    16     41       91.11
Vishnu Mukundan       24    17     41       91.11

In [44]:
df[df['TOTAL']==df['TOTAL'].max()]

            PYTHON  STAT  TOTAL  PERCENTAGE
NAME
Ansal M T       25    19     44       97.78
kiran k s       24    20     44       97.78
Ramshad TA      25    19     44       97.78